Core/src/Catalogs/ВидыНалогов/ВидыНалогов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНалогов</name>
  <predefined>
    <items>
      <name>АвансовыйПлатежПриУСН</name>
      <description>Авансовый платеж (УСН)</description>
    </items>
    <items>
      <name>ПФРСвыше300тр</name>
      <description>Взносы в ПФР при доходах свыше 300 тысяч руб.(ИП)</description>
    </items>
    <items>
      <name>ЕНВД</name>
      <description>Единый налог(ЕНВД)</description>
    </items>
    <items>
      <name>ЕдиныйНалогПриУСН</name>
      <description>Единый налог(УСН)</description>
    </items>
    <items>
      <name>Патент</name>
      <description>Налог с патента</description>
    </items>
    <items>
      <name>НДФЛКВыплате</name>
      <description>НДФЛ к выплати</description>
    </items>
    <items>
      <name>НДФЛНачисленный</name>
      <description>НДФЛ Начисленный</description>
    </items>
    <items>
      <name>НДФЛСотрудники</name>
      <description>НДФЛ при исполнении обязанностей налогового агента</description>
    </items>
    <items>
      <name>ПФРСтраховаяСотрудники</name>
      <description>Страховые взносы в ПФР по сотрудникам</description>
    </items>
    <items>
      <name>ПФРНакопительнаяСотрудники</name>
      <description>Страховые взносы в ПФР, накопительная часть по сотрудникам (до 2014 г)</description>
    </items>
    <items>
      <name>ФСССотрудники</name>
      <description>Страховые взносы в ФСС</description>
    </items>
    <items>
      <name>ФССТравматизмСотрудники</name>
      <description>Страховые взносы в ФСС от несчастных случаев</description>
    </items>
    <items>
      <name>ФОМССотрудники</name>
      <description>Страховые взносы в ФФОМС</description>
    </items>
    <items>
      <name>ТорговыйСбор</name>
      <description>Торговый сбор</description>
    </items>
    <items>
      <name>ПФРСтраховая</name>
      <description>Фиксированные взносы в ПФР</description>
    </items>
    <items>
      <name>ПФРНакопительная</name>
      <description>Фиксированные взносы в ПФР, накопительная часть (до 2014 г)</description>
    </items>
    <items>
      <name>ТФОМС</name>
      <description>Фиксированные взносы в ТФОМС</description>
    </items>
    <items>
      <name>ФФОМС</name>
      <description>Фиксированные взносы в ФФОМС</description>
    </items>
  </predefined>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКВозмещению</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>210</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <comment>Служебный реквизит</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежаИзменено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНалога</name>
    <comment>Заполняется для поставляемых данных</comment>
    <type>
      <types>EnumRef.ВидыНалогов</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспондирующийСчет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаКВозмещениюРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
</mdclass:Catalog>

Core/src/AccumulationRegisters/РасчетыПоНалогам/РасчетыПоНалогам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РасчетыПоНалогам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидНалога</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СрокУплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/ChartsOfAccounts/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Хозрасчетный</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконтоХозрасчетные</extDimensionTypes>
  <predefined>
    <items>
      <name>Вспомогательный</name>
      <description>Вспомогательный счет</description>
      <code>0000   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПереводыВПути</name>
      <description>Переводы в пути</description>
      <code>1290   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>РасчетыПоАвансамВыданным</name>
      <description>Расчеты по авансам выданным</description>
      <code>1480   </code>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>1610   </code>
    </items>
    <items>
      <name>ПоставляемыеМатериалы</name>
      <description>გადაცემული მარაგები</description>
      <code>1629      </code>
    </items>
    <items>
      <name>РасчетыСПоставщикамиИПодрядчиками</name>
      <description>Расчеты с поставщиками и подрядчиками</description>
      <code>3100   </code>
      <accountType>Passive</accountType>
      <childItems>
        <name>РасчетыСПоставщиками</name>
        <description>Расчеты с поставщиками</description>
        <code>3110   </code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>НалоговыеОбязательства</name>
      <description>გადასახდელი დღგ</description>
      <code>3330   </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>НалоговыеОбязательства_1</name>
      <description>გადასახდელი დღგ (/1)</description>
      <code>3330/1    </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>НачисленныйНДСНаПолученныйАванс</name>
      <description>მიღებულ ავანსზე დარიცხული დღგ</description>
      <code>3331   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПредворительныйЗачетПолученныйНаВыдааныАванс</name>
      <description>გაცემულ ავანსზე მიღებული წინასწარი ჩათვლა</description>
      <code>3332   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>НДС</name>
      <description>გადახდილი დღგ</description>
      <code>3340   </code>
    </items>
    <items>
      <name>НДС_1</name>
      <description>გადახდილი დღგ (/1)</description>
      <code>3340/1    </code>
    </items>
    <items>
      <name>ОплаченныеКОплатеНДСНаАванс</name>
      <description>ავანსზე გადახდილი/გადასახდელი დღგ</description>
      <code>3341   </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ЗачетПолученногоНДСНаВыданныАванс</name>
      <description>გაცემულ ავანსის თანხებზე მიღებული დღგ-ს ჩათვლა</description>
      <code>3342   </code>
      <accountType>ActivePassive</accountType>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодБыстрогоВыбора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СчетАналогУУ</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСчета</name>
    <type>
      <types>EnumRef.ТипыСчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределения</name>
    <type>
      <types>EnumRef.БазыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетЗакрытия</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаДоходовИРасходов</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyMapping</name>
    <type>
      <types>CatalogRef.AzRyMapping</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>НалоговыйУчет</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
  <extDimensionAccountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Core/src/Catalogs/ВидыНалогов/Forms/ФормаРедактированияСчетовУчета/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Функция проверяет возможность изменения счета учета.
//
&НаСервере
Функция ОтказИзменитьСчетУчета(Ссылка)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасчетыПоНалогам.Период,
	|	РасчетыПоНалогам.Регистратор,
	|	РасчетыПоНалогам.НомерСтроки,
	|	РасчетыПоНалогам.Активность,
	|	РасчетыПоНалогам.ВидДвижения,
	|	РасчетыПоНалогам.Организация,
	|	РасчетыПоНалогам.ВидНалога,
	|	РасчетыПоНалогам.Сумма,
	|	РасчетыПоНалогам.СодержаниеПроводки
	|ИЗ
	|	РегистрНакопления.РасчетыПоНалогам КАК РасчетыПоНалогам
	|ГДЕ
	|	РасчетыПоНалогам.ВидНалога = &ВидНалога");
	
	Запрос.УстановитьПараметр("ВидНалога", ?(ЗначениеЗаполнено(Ссылка), Ссылка, Неопределено));
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции // ОтказИзменитьСчетУчета()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере формы.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СчетУчета = Параметры.СчетУчета;
	СчетУчетаКВозмещению = Параметры.СчетУчетаКВозмещению;
	СчетУчетаРегл = Параметры.СчетУчетаРегл;
	СчетУчетаКВозмещениюРегл = Параметры.СчетУчетаКВозмещениюРегл;
	
	Ссылка = Параметры.Ссылка;
	
	Если ОтказИзменитьСчетУчета(Ссылка) Тогда
		Элементы.ГруппаСчетовУчета.Подсказка = НСтр("ka='ბაზაში არის მოძრაობები გადასახადის ამ ტიპის მიხედვით! აღრიცხვის დათვლის შეცვლა აკრძალულია!';ru='В базе есть движения по этому виду налога! Изменение счета учета запрещено!'");
		Элементы.ГруппаСчетовУчета.Доступность = Ложь;
		Элементы.ПоУмолчанию.Видимость = Ложь;
	КонецЕсли;
	
	РегламентированныйУчетСервер.УстановитьВидимостьУпрУчета(ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура - обработчик нажатия команды ПоУмолчанию.
//
&НаКлиенте
Процедура ПоУмолчанию(Команда)
	
	СчетУчета = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	СчетУчетаКВозмещению = ПредопределенноеЗначение("ПланСчетов.Управленческий.ПустаяСсылка");
	СчетУчетаРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.НДС");
	СчетУчетаКВозмещениюРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.Вспомогательный");
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры // ПоУмолчанию()

&НаКлиенте
Процедура ОповеститьОбИзмененииСчетов()
	
	СтруктураПараметры = Новый Структура(
		"СчетУчета, СчетУчетаКВозмещению, СчетУчетаРегл, СчетУчетаКВозмещениюРегл",
		СчетУчета, СчетУчетаКВозмещению, СчетУчетаРегл, СчетУчетаКВозмещениюРегл
	);
	
	Оповестить("ИзменилисьСчетаВидыНалогов", СтруктураПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчета) Тогда
	//	СчетУчета = ПредопределенноеЗначение("ПланСчетов.Управленческий.Налоги");
	//КонецЕсли;
	
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаКВозмещениюПриИзменении(Элемент)
	
	//Если НЕ ЗначениеЗаполнено(СчетУчетаКВозмещению) Тогда
	//	СчетУчета = ПредопределенноеЗначение("ПланСчетов.Управленческий.НалогиКВозмещению");
	//КонецЕсли;
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаРегл) Тогда
		СчетУчетаРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.НДС");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаРегл, СчетУчета);
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры

&НаКлиенте
Процедура СчетУчетаКВозмещениюРеглПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(СчетУчетаКВозмещениюРегл) Тогда
		СчетУчетаКВозмещениюРегл = ПредопределенноеЗначение("ПланСчетов.Хозрасчетный.НалоговыеОбязательства");
	КонецЕсли;
	РегламентированныйУчетСервер.УстановитьУпрСчетИзПланаСчетовХозрасчетный(СчетУчетаКВозмещениюРегл, СчетУчетаКВозмещению);
	ОповеститьОбИзмененииСчетов();
	
КонецПроцедуры
